uhnp/src/InformationRegisters/НастройкаЗаменыНоменклатурыЗакупок/НастройкаЗаменыНоменклатурыЗакупок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкаЗаменыНоменклатурыЗакупок</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Коэффициент</name>
    <comment>Если количество в единицах источника умножить на коэффициент, то получим количество в единицах приемника</comment>
    <type>
      <types>DefinedType.КоэффициентЕдиницыИзмеренияУХ</types>
    </type>
  </resources>
  <dimensions>
    <name>СпособЗамены</name>
    <type>
      <types>EnumRef.СпособыЗаменыНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатураИсточник</name>
    <type>
      <types>DefinedType.ТипНоменклатураЕХ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаИсточник</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЕдиницаИзмеренияИсточник</name>
    <type>
      <types>DefinedType.ТипЕдиницаИзмеренияЕХ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатураПриемник</name>
    <type>
      <types>DefinedType.ТипНоменклатураЕХ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаПриемник</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЕдиницаИзмеренияПриемник</name>
    <type>
      <types>DefinedType.ТипЕдиницаИзмеренияЕХ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/СпособыЗаменыНоменклатуры/СпособыЗаменыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыЗаменыНоменклатуры</name>
  <enumValues>
    <name>ПересчетЕдиницыИзмерения</name>
  </enumValues>
  <enumValues>
    <name>Унификат</name>
  </enumValues>
  <enumValues>
    <name>Аналоги</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/InformationRegisters/НастройкаЗаменыНоменклатурыЗакупок/Forms/ФормаСписка/Module.bsl
&НаКлиенте
Процедура СпособЗаменыОтборПриИзменении(Элемент)
	Если ЗначениеЗаполнено(СпособЗаменыОтбор) Тогда
		ОтборыСписковКлиентСерверУХ.ИзменитьЭлементОтбораСписка(Список, "СпособЗамены", СпособЗаменыОтбор, Истина);
		Если СпособЗаменыОтбор = ПредопределенноеЗначение("Перечисление.СпособыЗаменыНоменклатуры.ПересчетЕдиницыИзмерения") Тогда
			Элементы.НоменклатураИсточник.Заголовок = НСтр("ru = 'Номенклатура'");
			Элементы.ХарактеристикаИсточник.Заголовок = НСтр("ru = 'Характеристика'");
			Элементы.НоменклатураПриемник.Видимость = Ложь;
			Элементы.ХарактеристикаПриемник.Видимость = Ложь;
			Элементы.ЕдиницаИзмеренияИсточник.Заголовок = НСтр("ru = 'Ед. изм. база'");
			Элементы.ЕдиницаИзмеренияПриемник.Заголовок = НСтр("ru = 'Ед. изм. пересчет'");
			
			ЭтаФорма.Заголовок = НСтр("ru = 'Настройка замены номенклатуры'");
			
		иначеЕсли СпособЗаменыОтбор = ПредопределенноеЗначение("Перечисление.СпособыЗаменыНоменклатуры.Унификат") Тогда
			Элементы.НоменклатураИсточник.Заголовок = НСтр("ru = 'Номенклатура'");
			Элементы.ХарактеристикаИсточник.Заголовок = НСтр("ru = 'Характеристика номенклатуры'");
			Элементы.НоменклатураПриемник.Заголовок = НСтр("ru = 'Унификат'");
			Элементы.ХарактеристикаПриемник.Заголовок = НСтр("ru = 'Характеристика унификата'");
			Элементы.ЕдиницаИзмеренияИсточник.Заголовок = НСтр("ru = 'Ед. изм. исходная'");
			Элементы.ЕдиницаИзмеренияПриемник.Заголовок = НСтр("ru = 'Ед. изм. унификата'");
			Элементы.НоменклатураПриемник.Видимость = Истина;
			
			ЭтаФорма.Заголовок = НСтр("ru = 'Настройка унификатов номенклатуры'");
			
		иначеЕсли СпособЗаменыОтбор = ПредопределенноеЗначение("Перечисление.СпособыЗаменыНоменклатуры.Аналоги") Тогда
			Элементы.НоменклатураИсточник.Заголовок = НСтр("ru = 'Номенклатура исходная'");
			Элементы.ХарактеристикаИсточник.Заголовок = НСтр("ru = 'Характеристика исходная'");
			Элементы.НоменклатураПриемник.Заголовок = НСтр("ru = 'Номенклатура аналог'");
			Элементы.ХарактеристикаПриемник.Заголовок = НСтр("ru = 'Характеристика аналога'");
			Элементы.ЕдиницаИзмеренияИсточник.Заголовок = НСтр("ru = 'Ед. изм. исходная'");
			Элементы.ЕдиницаИзмеренияПриемник.Заголовок = НСтр("ru = 'Ед. изм. аналог'");
			Элементы.НоменклатураПриемник.Видимость = Истина;
			
			ЭтаФорма.Заголовок = НСтр("ru = 'Настройка аналогов номенклатуры'");
			
		КонецЕсли;
		
	Иначе
		ОтборыСписковКлиентСерверУХ.УдалитьЭлементОтбораСписка(Список, "СпособЗамены");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураИсточникПриИзменении(Элемент)
	Если НЕ ЗначениеЗаполнено(СпособЗаменыОтбор) Тогда
		Возврат;
	КонеЦЕсли;
	
	ТекДанные = Элементы.Список.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если СпособЗаменыОтбор = ПредопределенноеЗначение("Перечисление.СпособыЗаменыНоменклатуры.ПересчетЕдиницыИзмерения") Тогда
		ТекДанные.НоменклатураПриемник = ТекДанные.НоменклатураИсточник;
		
	иначеЕсли СпособЗаменыОтбор = ПредопределенноеЗначение("Перечисление.СпособыЗаменыНоменклатуры.Унификат") Тогда
		
		
	иначеЕсли СпособЗаменыОтбор = ПредопределенноеЗначение("Перечисление.СпособыЗаменыНоменклатуры.Аналоги") Тогда
		
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ХарактеристикаИсточникПриИзменении(Элемент)
	Если СпособЗаменыОтбор = ПредопределенноеЗначение(
			"Перечисление.СпособыЗаменыНоменклатуры.ПересчетЕдиницыИзмерения") Тогда
		ТекДанные = Элементы.Список.ТекущиеДанные;
		Если ТекДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		ТекДанные.ХарактеристикаПриемник = ТекДанные.ХарактеристикаИсточник;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ВидОперации") И ЗначениеЗаполнено(Параметры.ВидОперации) Тогда
		СпособЗаменыОтбор = Параметры.ВидОперации;
		Элементы.СпособЗаменыОтбор.ТолькоПросмотр = Истина;
	Иначе
		СпособЗаменыОтбор = Перечисления.СпособыЗаменыНоменклатуры.ПересчетЕдиницыИзмерения;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СпособЗаменыОтборПриИзменении(Элементы.СпособЗаменыОтбор);
КонецПроцедуры
